Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: དེ་དགེ་བའི་རྩ་བ་དེ་ཉིད་དང་ལྡན་པས་ཡང་བ་བཞི་འཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བསྟན་པ་མཚན་ཉིད་མ་ཚང་བ་མེད་ཅིང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་བསྟན་པ་འབྲས་བུ་ཡོད་པ་ཡང་བ་དང་པོ་འདི་ཐོབ་བོ། །དགེ་བའི་རྩ་བ་དེ་ཉིད་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པས་དགེ་སློང་ཚུར་ཤོག་ཅེས་གསུང་བར་འགྱུར་ཏེ དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱས་ན་སྐྲ་བྲེགས་པར་འགྱུར། ངུར་སྨྲིག་གྱོན་ཅིང་ལྷུང་བཟེད་ཐོགས་པར་འགྱུར་ཏེ། ཡང་བ་གཉིས་པ་འདི་འཐོབ་བོ། །དགེ་བའི་རྩ་བ་དེ་ཉིད་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དུས་གསུམ་གྱི་སེམས་རབ་ཏུ་མཁྱེན་ཏེ། ཡང་བ་གསུམ་པ་འདི་འཐོབ་བོ། །དགེ་བའི་རྩ་བ་དེ་ཉིད་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྨན་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏེ། ཡང་བ་བཞི་པ་འདི་འཐོབ་བོ། །དེ་དག་ནི་ཡང་བ་བཞི་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལྟར་དེ་ལེགས་པར་ཞུགས་པས་སློབ་དཔོན་དང་མཁན་པོ་ལ་ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་བའི་ཕྱིར་རོ། །
en: “With these roots of virtue he obtains four kinds of ease. What are these four kinds of ease? The first kind of ease he obtains is that the teachings of the lords, the buddhas, are in no way lacking, and that the lords, the buddhas’ instructions in the Dharma are not ineffective. The second kind of ease he obtains is that with these roots of virtue the Tathāgata can say, ‘Come, monk!’ he can say, ‘Follow me, monk!’ and the bodhisatva will then cut off his hair, don saffron, and take up the alms bowl. The third kind of ease he obtains is that with these roots of virtue, the Tathāgata knows the minds of all beings in the three times. The fourth kind of ease he obtains is that with these roots of virtue, the Tathāgata knows what kind of medicine is appropriate for any sentient being. These are the four kinds of ease. How do they come about? They come about because he offered his water flask to his teachers and preceptors with a strong, well-developed motivation.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་དེ་ཉིད་དང་ལྡན་པས་གཞན་གྱིས་མི་ཚུགས་པའི་ཆོས་བཞི་འཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་མེ་དང་། མཚོན་དང་། དུག་གིས་ཚུགས་པ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་པ་དང་། ཕ་རོལ་གྱི་གནོད་པ་བྱས་པས་འཆི་བའི་དུས་བྱེད་པར་འགྱུར་བ་དེ་ལྟ་བུའི་གནས་མེད་དོ། ། ཕ་རོལ་གྱིས་མི་ཚུགས་པའི་ཆོས་བཞི་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “Moreover, Śāriputra, with these roots of virtue the bodhisatva obtains four qualities of unassailability. What are these four qualities of unassailability? It is not the case, Śāriputra, that the Tathāgata can be hurt by fire, by weapons, or by poison, or that he can suffer an untimely death by means of any kind of external harm. This is what is impossible. This is not the case. These are the four qualities of unassailability that he obtains.

source: དེ་ཡང་ཕ་རོལ་གྱིས་མི་ཚུགས་པའི་ཆོས་བཞི་འཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། ཤཱ་རིའི་བུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པས་མ་གསན་པའི་ཆོས་ཐ་ན་ཆོས་ཀྱི་ཚིག་གཅིག་ཙམ་ཡང་ཐོས་པར་བྱེད་ནུས་པ་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། དེ་ལྟ་བུའི་གནས་མེད་དོ། ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཐ་ན་སེམས་བསྐྱེད་པ་གཅིག་ཙམ་ཡང་མཉམ་པར་མ་བཞག་པའི་སེམས་རྙེད་པར་འགྱུར་བའི་བར་དུ་དེ་ལྟ་བུའི་གནས་མེད་དོ། ། གཞན་ཡང་ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་རྟག་ཏུ་མཉམ་པར་བཞག་པ་སྟེ། དེ་བཞིན་གཤེགས་པ་ནི་བྱམས་པ་ལ་གནས། སྙིང་རྗེ་ལ་གནས། དགའ་བ་གནས། བཏང་སྙོམས་ལ་གནས་སོ། ། ཤཱ་རིའི་བུ་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་ལུས་སམ། གཟུགས་ལ་མཚན་མར་འཛིན་ནུས་པ་ནི་གནས་མ་ཡིན་ཞིང་སྐབས་མེད་དེ། དེ་ལྟ་བུའི་གནས་མེད་དོ། ། གཞན་གྱིས་མི་ཚུགས་པར་བྱེད་པའི་ཆོས་བཞི་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “There is a further set of four qualities of unassailability that he obtains. What are these four qualities of unassailability? It is not the case, Śāriputra, that any sentient being is able to learn even a single word of the Dharma of the Tathāgata that is beyond the sphere of learning. This is what is impossible. This is not the case. It is not the case, and so forth, that any sentient being can identify even a single mental event of the Tathāgata’s that is not concentrated. This is what is impossible. This is not the case. Śāriputra, the Tathāgata always dwells in concentration. The Tathāgata dwells in love, in compassion, in empathetic joy, and in equanimity. It is not the case, Śāriputra, that any sentient being is able to fully understand the body, the form, and the attributes of the Tathāgata. This is what is impossible. This is not the case. These are the four further qualities of unassailability that he obtains.

source: ཤཱ་རིའི་བུ་འདི་ལྔ་ནི་དེ་བཞིན་གཤེགས་པའི་ཚད་མེད་པར་བྱེད་པའི་ཆོས་སོ། ། ལྔ་གང་ཞེ་ན། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཚད་མེད་པ་དང་། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པའི་ཐོས་པ་ཚད་མེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ཀྱིས་རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཚད་མེད་པ་སྟེ། ཤཱ་རིའི་བུ་ལྔ་པོ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་ཚད་མེད་པར་བྱེད་པའི་ཆོས་སོ། །
en: “Śāriputra, the Tathāgata possesses five immeasurable qualities. What are these five immeasurable qualities? Śāriputra, the morality of the Tathāgata is immeasurable. The concentration, the wisdom, the liberation, and the insight into the knowledge of liberation of the Tathāgata are immeasurable. These, Śāriputra, are the five immeasurable qualities of the Tathāgata.

source: ཚུར་ཤོག་ཅེས་བྱས་ན་ཡང་འོང་བའི་དགེ་བའི་རྩ་བ་དེ་ཉིད་དང་ལྡན་པས་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་བཞི་འཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་འདས་པའི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མ་འོངས་པའི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ད་ལྟར་བྱུང་བའི་དུས་ལ་མ་ཆགས་མ་ཐོགས་པའི་ཡེ་ཤེས་མཐོང་བ་འཇུག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སེམས་མཉམ་པར་བསྒྲུབ་པ་སྟེ། སེམས་མཉམ་པར་བསྒྲུབ་པ་དེས་དེ་བཞིན་གཤེགས་པའི་དུས་གསུམ་མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་དང་། ཡང་དག་པའི་ཡེ་ཤེས་དང་ལྡན་ནོ། ། ཡང་དག་པའི་ཡེ་ཤེས་དེས་གཞན་ལ་རག་མ་ལས། གཞན་གྱི་ཁར་མ་ལས་པར་ཆོས་ཐམས་ཅད་ཤེས་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་བོ། །བསམ་གྱིས་མི་ཁྱབ་པའི་ཡེ་ཤེས་དེ་དང་ལྡན་པས་རླུང་དང་། ཆར་རབ་ཏུ་མཁྱེན་ཏེ། རྗེས་སུ་འཐུན་པ་ཞེས་བྱ་བའི་རླུང་ལྡང་སྟེ། སེམས་ཅན་ཇི་སྙེད་པས་ཅུང་ཟད་སོ་སོར་རྗེས་སུ་མྱོང་བར་འགྱུར་ཏེ། རླུང་དེའི་འཕང་དུ་རྒྱང་གྲགས་གསུམ་མོ། ། དེའི་སྟེང་གི་བར་སྣང་ལ་རླུང་སྤྲིན་ཅེས་བྱ་བའི་རླུང་ལྡང་སྟེ། དེའི་འཕང་དུ་རྒྱང་གྲགས་ལྔའོ། དེའི་སྟེང་གི་བར་སྣང་ལ་འཛོམས་པ་ཞེས་བྱ་བའི་རླུང་ལྡང་སྟེ། རླུང་དེའི་དཀྱིལ་འཁོར་གྱི་འཕང་དུ་དཔག་ཚད་བཅུའོ། ། དེའི་སྟེང་གི་བར་སྣང་ལ་སྐྱེ་བྲལ་ཞེས་བྱ་བའི་རླུང་ལྡང་སྟེ། རླུང་གི་དཀྱིལ་འཁོར་དེའི་འཕང་དུ་དཔག་ཚད་སུམ་ཅུའོ། ། དེའི་སྟེང་གི་བར་སྣང་ལ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བའི་རླུང་ལྡང་སྟེ། རླུང་གི་དཀྱིལ་འཁོར་དེའི་འཕང་དུ་དཔག་ཚད་བཞི་བཅུའོ། །
en: “Śāriputra, he follows when he is instructed to follow, and possessing roots of virtue in this way, he obtains four kinds of unimpeded knowledge. What are these four kinds of unimpeded knowledge? His insight into the knowledge of the lords, the buddhas, of the past is unimpeded and unobstructed. His insight into the knowledge of the lords, the buddhas, of the future is unimpeded and unobstructed. His insight into the knowledge of the lords, the buddhas, of the present is unimpeded and unobstructed. The Tathāgata remains concentrated, and by means of his concentration he has unified knowledge of the three times. The Tathāgata’s knowledge is perfect, and by means of his perfect knowledge he has knowledge of all phenomena, and this knowledge is neither obstructed by nor dependent on anything external. The Tathāgata’s knowledge is inconceivable. As he possesses this inconceivable knowledge, the Tathāgata has intimate knowledge of the winds and rain. There is a wind that blows called harmonious that can be experienced by any sentient being, and this wind rises to a height of three krośas. Above this there blows a wind called cloud wind, and this wind system rises to a height of five krośas. Above this there blows a wind called destroyer, and this is a system of winds that rises to a height of ten yojanas. Above this there blows a wind called free from birth, and this is a system of winds that rises to a height of thirty yojanas. Above this there blows a wind called transcendent, and this is a system of winds that rises to a height of forty yojanas. Śāriputra, the tathāgata, arhat, fully accomplished Buddha is able to know six hundred eighty billion wind systems by relying on wisdom. The final wind system is called all pervasive. It rises to a height of sixty-eight thousand yojanas above the level of where the water element is found on earth, and its height above the ground is sixty-eight thousand yojanas.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཤེས་རབ་ལ་རྟོན་པ་སྟེ། རླུང་གི་དཀྱིལ་འཁོར་བྱེ་བ་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་ལ་ཐ་མའི་རླུང་གི་དཀྱིལ་འཁོར་ཀུན་ཏུ་ཁྱབ་ཅེས་བྱ་སྟེ། གང་ལ་ས་ཆེན་པོ་གནས་པའི་ཆུའི་ཕུང་པོ་འཕང་དུ་དཔག་ཚད་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ཡོད་དེ། ས་ཆེན་པོའི་འཕང་དུ་ཡང་དཔག་ཚད་སྟོང་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་དོ། ། དེ་ལྟར་ཤཱ་རིའི་བུ་གྲངས་དང་། བགྲང་བ་བསྟན་པས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཏེ། དེ་ན་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ད་ལྟར་བཞུགས་ཏེ་འཚོ་ཞིང་བཞེས་སོ། ། དེའི་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་སུམ་ཅུ་འོ། ། དེའི་འཁོར་ཉན་ཐོས་ནི་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་སུམ་ཅུ་སྟེ། ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ། སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པའི་བར་ཏུ་སྟེ། ཉན་ཐོས་ཆེན་པོ་རྣམས་ཀྱི་ཉན་ཐོས་འདུས་པ་ཆེན་པོ་ཡོད་དོ། ། དེའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་ཕྲག་བརྒྱ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཐོབ་པ། དོན་ལ་ཤིན་ཏུ་རྣམ་པར་ངེས་པ། ཐོས་པ་རྒྱ་མཚོ་ཆོས་སྨྲ་བ། སྟོང་པ་ཉིད་ལ་གནས་པ། མཚན་མ་མེད་པ་ལ་གནས་པ། སྨོན་པ་མེད་པ་ལ་གནས་པ་ཆེན་པོ་ཤ་སྟག་འདུས་པ་ཡོད་དོ། ། དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་ལོ་སྟོང་དུ་གནས་པར་འགྱུར་རོ། ། ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ལོ་སྟོང་ན་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་ཏེ། དེའི་རིང་བསྲེལ་ཡང་རྒྱས་པར་འགྱུར་རོ། ། འདི་ལྟ་སྟེ། དཔེར་ན། ང་ད་ལྟར་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་རིང་བསྲེལ་རབ་ཏུ་རྒྱས་པར་འགྱུར་བ་བཞིན་ནོ།
en: “Śāriputra, such figures and reckonings characterize the threefold thousand great thousand worlds, and it is here that the tathāgata, arhat, fully accomplished buddha by the name of Mahāskandha presently resides. This is where he dwells and where he is active. He has a lifespan of ten million years. He is accompanied by a great assembly of śrāvakas consisting of three hundred million billion great śrāvakas who are all arhats, who have eliminated the defilements, who are free from vices, who are powerful, and who have reached the very highest level of complete mastery of the mind. He is accompanied by an assembly of a billion great bodhisatvas, great beings, who are accomplished in The Collected Teachings on the Bodhisatva, who have a thorough grasp of its meaning, who possess a great ocean of learning and can express the Dharma, who dwell in the state of emptiness, who dwell in the state of freedom from attributes, and who dwell in the state of freedom from aspirations. After his final passing, the true Dharma will last for a thousand years: ‘One thousand years after my final passing, it, too, will finally pass away.’ His relics will be distributed: ‘As I now pass into final nirvāṇa, my relics are to be distributed.’

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཡེ་ཤེས་ཐོགས་པ་མེད་པ་སྟེ། དེ་བས་ཀྱང་ལྷག་པར་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་དཔག་ཏུ་མེད་དོ། ། རླུང་གི་དཀྱིལ་འཁོར་ཡོངས་སུ་ཁྱབ་པས་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་ཁྱབ་བོ། །ཤཱ་རིའི་བུ་སྟེང་གི་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ནད་ལྟར་དེ་བཞིན་གཤེགས་པ་མེད་པ་ཡང་ཡོད་དོ། ། དེ་ན་རང་སངས་རྒྱས་བརྒྱ་ཕྲག་སྟོང་ཡོད་དེ། དེ་དག་ལ་སེམས་ཅན་རྣམས་དགེ་བའི་རྩ་བསྐྱེད་དོ། །
en: “Śāriputra, the knowledge of the Tathāgata is unimpeded. There is no measure higher than the knowledge of the Tathāgata. The field of a buddha reaches as far as the winds can travel. Śāriputra, there are worlds to the zenith where there is no tathāgata at present, but in those worlds there are a hundred thousand pratyekabuddhas in the presence of whom living beings are cultivating roots of virtue.

source: ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཡེ་ཤེས་ལ་རྟོན་པ་སྟེ། དེའི་ཡང་སྟེང་གི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པ་ད་ལྟར་བྱུང་བ་རྣམས་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་བཞིན་དུ་ཕྱོགས་བཅུ་ཀུན་ཏུ་ཚད་མེད་གྲངས་མེད་གཞལ་དུ་མེད་དཔག་ཏུ་མེད་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ད་ལྟར་བྱུང་བ་དེ་དག་རབ་ཏུ་མཁྱེན་ཏེ སངས་རྒྱས་ཀྱི་ཞིང་ཚིག་པ་དེ་སྙེད་ཀྱང་རབ་ཏུ་མཁྱེན་ཏོ། ། དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: “Śāriputra, the Tathāgata relies on knowledge, and hence he fully knows the tathāgatas, the arhats, the fully accomplished buddhas, as numerous as the grains of sand in the river Ganges, who are appearing right at this moment. He fully knows the unlimited, innumerable, inconceivable, incomparable, immeasurable tathāgatas, arhats, fully accomplished buddhas, who are appearing in the ten directions at this very moment. He fully knows the buddha fields that are burning, however many they may be.”

source: བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། ། བཅོམ་ལྡན་འདས་དགེ་བའི་རྩ་བ་གང་དང་ལྡན་པས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འདི་ལྟ་བུར། སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་དང་ལྡན།
en: When the Lord had said this, the venerable Śāriputra then asked him, “Lord, which roots of virtue does the tathāgata, arhat, fully accomplished Buddha possess that provide him with unobscured knowledge?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ཤཱ་རིའི་བུ་ང་དབང་ལ་རབ་ཏུ་གནས་ཏེ། ཆོས་ལ་གུས་པའི་འདུ་ཤེས་དང་། རི་མོར་བྱས་ཏེ་ སྨན་དུ་འདུ་ཤེས་པ་དང་། རིན་པོ་ཆེར་འདུ་ཤེས་པ་དང་། དཀོན་པར་འདུ་ཤེས་པ་དང་། དགེ་བའི་རྩ་བར་འདུ་ཤེས་པ་དང་། ཇི་ལྟ་བ་བཞིན་ཏུ་འདུ་ཤེས་བསྐྱེད་ནས་གུས་པའི་འདུ་ཤེས་དང་། ཆོས་སུ་འདུ་ཤེས་ཡོངས་སུ་བཟུང་བ་ལ་གནས་ཏེ ཤཱ་རིའི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འབར་བས། ཤཱ་རིའི་བུ་དེ་བཞིན་གཤེགས་པས་ཤིན་ཏུ་མང་པོ་དང་དེ་བས་ཀྱང་ལྷག་པར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡེ་ཤེས་རྒྱུན་མི་འཆད། དཔག་ཏུ་མེད། གྲངས་མེད། གཞལ་དུ་མེད། བརྗོད་དུ་མེད་པར་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The Lord answered, “Śāriputra, my powers are complete, and seeing the greatness of the Dharma, I venerate it, and I consider it to be medicine, to be precious, to be difficult to obtain, to be the root of virtue, to be genuine. Taking hold of it with this reverential approach, I master the approach of the Dharma, and as a consequence, Śāriputra, the knowledge of the Tathāgata blazes forth. The Tathāgata comes to know a great many things. The knowledge of the lords, the buddhas, is so supreme that it is uninterrupted, it is unlimited, it cannot be reckoned, and it is inconceivable, incomparable, and inexpressible.

source: ཚུར་ཤོག་ཅེས་བྱས་ན་ཡང་འོང་བའི་དབང་དེས་སེ་གོལ་གཏོགས་པ་སྲིད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་གི་བྱེ་མ་དང་མཉམ་པར་འཆག་ཅིང་སླར་ཡང་འོང་ངོ་། ། ཤཱ་རིའི་བུ་ངས་མོས་པས་ཐོས་པ་བཟུང་བས་དེ་ཉིད་ཀྱིས། མྱུར་དུ་རྣམ་པར་གྲོལ་བ་ཐོབ་སྟེ། རྣམ་པར་གྲོལ་བ་དེས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་ལོ། ། ཅི་ལས་རྣམ་པར་གྲོལ་ཞེ་ན། སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་ལོ། །
en: “With the power that comes from following when he is told to follow, the Tathāgata is able to travel across as many buddha fields as there are grains of sand in the river Ganges, and back again, in the blink of an eye. Śāriputra, this confidence that allows me to accumulate learning is what will facilitate swift liberation. My liberation is true liberation. What is it liberation from? It is true liberation from all suffering.

source: ཤཱ་རིའི་བུ་གང་ལ་ལས་གུས་པའི་གནས་བཞི་ཐོབ་པ་ཙམ་གྱིས་དང་བ་ཐོབ་ནས་ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་དང་འབྲལ་བར་མི་འགྱུར་བ་དེ་ལྟར་གནས། དེ་བཞིན་དུ་གནས་དེ་ལྟ་བུའི་ཚུལ་དུ་གནས་པར་བྱའོ། ། སྙམ་དུ་སེམས་བསྐྱེད་ན་ཡང་འདི་ལྟ་བུའི་མདོ་སྡེའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་ཚིག་དང་ཡི་གེ་མི་འཛིན་ཀྱང་དེ་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱིས་ཤེས་རབ་བྱེད་པའི་ཆོས་བཞི་འཐོབ་པར་འགྱུར་ཏེ བཞི་གང་ཞེ་ན། ཤེས་རབ་ཅན་ཤེས་རབ་ཆེན་པོ་དང་ལྡན་པར་འགྱུར་བ་དང་། ཤེས་རབ་ཅན་སངས་རྒྱས་མཐོང་ཞིང་ཕྲད་ནས་ མཉེས་པར་བྱེད་པ་དང་། ཤེས་རབ་ཅན་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་བ་དང་། ཤེས་རབ་ཅན་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱ་བ་སྟེ། ཤེས་རབ་བྱེད་པའི་ཆོས་བཞི་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “Śāriputra, those who simply hear about these fourfold sets that inspire reverence will reach the following conviction: ‘We will abide by this. We will follow this way. This is what we will stick to, and so we will never again be separated from the Buddha’s teachings.’ Even though they may not remember the exact words and phrases of the discourses containing these instructions, these roots of virtue will still lead them to obtain four things that are generated by wisdom. What are these four things? With wisdom, they will reach great wisdom. With wisdom, they will have the good fortune of seeing and meeting buddhas. With wisdom, they will develop the faith that will lead them to leave ordinary household life behind and become renunciants. With wisdom, they will reach the state of unsurpassed, fully accomplished buddhahood. These are the four things that are generated by wisdom.

source: དེ་མང་པོར་བྱེད་པའི་ཆོས་བཞི་འཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། མིར་འགྱུར་བ་མང་པོ་རྙེད་པ་དང་། སངས་རྒྱས་འབྱུང་བ་མཉེས་པར་བྱེད་པ་མང་པོ་དང་། དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་བ་མང་པོ་དང་། བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མང་པོ་སྟེ། མང་པོར་བྱེད་པའི་ཆོས་བཞི་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ། །
en: “They will obtain four things in abundance. What are these four things? They will obtain an abundance of human states of existence. They will obtain an abundance of opportunities to meet a buddha. They will obtain an abundance of faith that will lead them to leave ordinary household life behind and become renunciants. They will obtain the abundance of reaching the state of unsurpassed, fully accomplished buddhahood. These are the four things that they will obtain in abundance.

source: དེ་ཡན་ལག་བཞི་རྗེས་སུ་འཐོབ་པར་འགྱུར་ཏེ། བཞི་གང་ཞེ་ན། འཁོར་ལོས་སྒྱུར་བའི་ཡན་ལག་རྗེས་སུ་འཐོབ་སྟེ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོར་འགྱུར་བ་དང་། ཚངས་པའི་འཇིག་རྟེན་དུ་ཚངས་པར་འགྱུར་བ་དང་། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དུ་འགྱུར་བ་དང་། བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་རྗེས་སུ་འཐོབ། སྟོབས་བསྔགས་པ་རྗེས་སུ་འཐོབ། སེམས་ཅན་ཡོངས་སུ་རྟོགས་པའི་ཡེ་ཤེས་རྗེས་སུ་འཐོབ། རྫུ་འཕྲུལ་གྱི་སྤྱོད་ཡུལ་ཡང་རབ་ཏུ་མཁྱེན་ཅིང་ལྷར་བཅས་པའི་འཇིག་རྟེན་གྱི་མིག་ཏུ་འགྱུར་རོ། །
en: “They will attain four states. What are these four states? They will obtain the state of being a universal one. They will become a king of the entire world, they will become Brahmā in the realm of the brahmā gods, they will become Śakra, the lord of the gods, and reaching the state of unsurpassed, fully accomplished buddhahood, they will obtain mastery of the entirety of the Dharma. They will obtain the power of good reputation. They will obtain insight into the mental abilities of sentient beings. They will know the scope of magical abilities, and their eyesight will be like that of those who dwell in the heavenly realms.”

source: འཇིག་རྟེན་གྱི་ནི་སྐྱབས་དང་མིག །སེམས་ཅན་ཀུན་གྱི་དམ་པ་སྟེ། །
en: “He is a protector and a guide for the world, Supreme among all sentient beings.

source: གང་རེག་མྱ་ངན་འདའ་འགྱུར་བའི། །གསོ་བ་ཐམས་ཅད་རབ་ཏུ་ཤེས། །
en: He knows all modes of healing That lead one to attain nirvāṇa.

source: ཚུར་ཤོག་ཅེས་བྱས་འོང་གྱུར་པའི། །རྣམ་པར་སྨིན་པ་འདི་འདྲ་སྟེ། ། ནམ་ཡང་སྡུག་བསྔལ་མི་འགྱུར་ཞིང་། །བཀའ་བློ་མི་བདེར་ཡོང་མི་འགྱུར། །
en: “The consequences that come From him following the advice he received Are that he will never experience any sort of suffering And will never fail to value advice.

source: ལྷ་ཡི་ནང་དུ་མྱུར་འགྲོ་ཞིང་། །མི་ཡི་ནང་དུའང་མྱུར་དུ་འགྲོ། །
en: “He easily goes the heavenly realms, He easily takes human existences,

source: སངས་རྒྱས་དག་ཀྱང་མྱུར་མཐོང་ཞིང་། །མི་ཁོམ་རྣམ་པར་སྤོང་བར་འགྱུར། །
en: He easily comes to behold the buddhas, And he will avoid misfortune.

source: འབྱོར་ཅིང་ནོར་ཡང་ཆེན་པོར་འགྱུར། །གཏེར་གྱི་རྣམས་ནི་མང་མཐོང་ཞིང་། །
en: “He becomes wealthy, with great riches, And he discovers many treasures.

source: གང་དུ་ལག་པ་བཅུག་པ་རྣམས། །ཐམས་ཅད་རིན་ཆེན་གང་བར་འགྱུར། །ཡན་ལག་བརྒྱད་ཀྱི་ཆུས་གང་བའི། །རྫིང་བུ་རབ་ཏུ་བསགས་པར་འགྱུར། །
en: Whatever he lays his hand upon Fills with all kinds of jewels. “He is surrounded by Ponds of perfect water with eight qualities.

source: ནམ་ཡང་མྱ་ངན་མི་མྱོང་སྟེ། །བཀའ་བློ་བདེ་བའི་འབྲས་བུ་འདི།
en: He will never have to experience pain. This is the result of being receptive to advice.

source: །ཐིང་བོ་ཞ་བོར་མི་འགྱུར་ཞིང་། །རྐང་པ་འཁུམས་དང་འབུབ་པ་དང་། ། ཡན་ལག་སྐམ་པར་མི་འགྱུར་ཞིང་། །ཡན་ལག་ཉམས་པར་མི་འགྲོའོ། །
en: “He does not become crippled or lame. His legs do not shrivel up or become bent. His limbs do not cause him any pain, Nor do they ever deteriorate.

source: སོར་མོ་དགུ་བར་མི་འགྱུར་ཞིང་། །སྒུར་པོ་ཞར་བར་མི་འགྱུར་རོ། །
en: “He does not lack any fingers, Nor is he hunchbacked or one eyed.

source: གླང་པོའི་མགོ་ལྟར་མི་འགྱུར་ཏེ། །
en: He does not suffer from elephantiasis.

source: བཀའ་བློ་བདེ་བའི་འབྲས་བུ་འདི། །
en: This is the result of being receptive to advice.

source: དེ་ཡི་ཡན་ལག་རྒྱས་ཤིང་དཀར། །ལྕགས་ཀྱི་དངོས་པོ་འདྲ་བར་འགྱུར། །
en: “His limbs are full and brilliant And as sturdy as iron.

source: རབ་ཏུ་མཛེས་ཤིང་བལྟ་ན་སྡུག །ཁ་དོག་ལྡན་ཞིང་མཛེས་པར་གནས། །
en: He is beautiful, attractive, And elegant, with a bright complexion.

source: ལྷ་ཡིས་མངོན་པར་མཆོད་པར་འགྱུར། །མི་རྣམས་ཤིན་ཏུ་བསྟི་སྟང་བྱེད། །
en: “He is venerated by the gods And honored by human beings.

source: ཀླུ་རྣམས་ཀྱིས་ནི་མངོན་མཆོད་འགྱུར། །
en: He is venerated by the nāgas.

source: བཀའ་བློ་བདེ་བའི་འབྲས་བུ་འདི།
en: This is the grace of being receptive to advice.

source: །ངན་འགྲོ་ཐམས་ཅད་སྤངས་ནས་ནི། །མི་དེ་མཐོ་རིས་འགྲོ་བར་འགྱུར། །མྱུར་དུ་བྱང་ཆུབ་འཚང་རྒྱ་སྟེ། །བཀའ་བློ་བདེ་བའི་འབྲས་བུ་འདི། །
en: “Having left the lower realms behind, He travels to the higher abodes, And as a man he quickly realizes awakening—This is the result of being receptive to advice.

source: མི་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །སེམས་རྣམས་ཐམས་ཅད་རབ་ཏུ་ཤེས། །གོམ་པ་དག་ནི་བདུན་བོར་ནས། །འཇིག་རྟེན་དབྱངས་ཀྱིས་གོ་བར་བྱེད། །
en: “This man knows the minds Of all sentient beings fully, And so he takes seven steps And makes a declaration to the world.

source: དེ་ཡི་ཡེ་ཤེས་མཆོག་འགྱུར་ཞིང་། །ཤེས་རབ་དག་ཀྱང་མཆོག་ཏུ་འགྱུར། །
en: “His knowledge is supreme. His wisdom is supreme.

source: རྣམ་པར་གྲོལ་བ་མཆོག་འགྱུར་ཏེ། །
en: His liberation is supreme.

source: སེམས་ཅན་རྣམས་ནི་ཀུན་གྱི་མཆོག །
en: He is supreme among all sentient beings.

source: ཤེས་རབ་ཀྱིས་ནི་ཤེས་རབ་སྦྱོང་། །ཤེས་རབ་ཡེ་ཤེས་གནས་པ་སྟེ། །
en: “With wisdom, his wisdom is perfected, And he is firmly established in wisdom and knowledge.

source: ཤེས་རབ་ཡེ་ཤེས་རྣམ་པར་གྲོལ། །
en: Wisdom, knowledge, and liberation

source: སངས་རྒྱས་ཀུན་གྱིས་བརྙེས་པ་ཡིན། །
en: Are what all buddhas cultivate.

source: ཤེས་རབ་ཀྱིས་ནི་རང་བཞིན་ཤེས། །ཡེ་ཤེས་ཀྱིས་ནི་ཤེས་བྱ་ཤེས། །
en: “With wisdom the true nature of things becomes known, And with knowledge what is knowable becomes known.

source: གང་དག་ཤེས་རབ་ཡེ་ཤེས་དག །ཐམས་ཅད་དེ་ལ་དཀོན་མི་འགྱུར། །
en: Nothing is difficult to grasp For one who possesses wisdom.

source: འདི་འདྲའི་དགེ་བ་འདི་དག་གི །དོན་ནི་ཁྱོད་ལ་ངས་བཤད་དོ། །དེ་ནི་མོས་པ་ཆུང་བ་ཡི། །སེམས་ཅན་རྣམས་ཀྱི་དོན་མ་ཡིན། །
en: “These are the sorts of excellent things That I have taught you, But beings with little inclination toward these things Do not consider them to be of any use.

source: གཏི་མུག་གིས་ནི་རྨོངས་པ་དང་། །སྡིག་པས་མངོན་པར་གཙེས་པ་རྣམས། །ཞེ་སྡང་ཁྲོ་བ་བསྐྱེད་བྱས་ནས། །ཆོས་ལ་གུས་པར་མི་འགྱུར་རོ། །
en: “Oppressed by delusion, They are foolish and evil. They become angry and hateful And develop no respect for the Dharma.

source: ནམ་ཞིག་སེམས་ཅན་མོས་ཆུང་ཚེ། །འདི་འདྲ་བ་ཡི་ཆོས་འབྱུང་སྟེ། །དེ་ན་ཕྱིར་ཞིང་གཅིག་ལ་གཅིག །གུས་པ་བྱེད་པར་མི་འགྱུར་ཏེ། །
en: “As these beings have little dedication, They cultivate these sorts of things And will have no reverence For one another.

source: གང་ཚེ་སེམས་ཅན་མི་གུས་ཤིང་། །ཁྲོ་བའི་ཉེས་ལ་ཡིད་དགའ་སྟེ། །ཀུན་ནས་ཉོན་མོངས་སེམས་ཀྱིས་ཀྱང་།
en: “Beings who never have any reverence, But take joy in the evils of anger, Will proclaim, with a mind filled with vices:

source: །དེ་དག་བདག་ཅག་དགྲ་བཅོམ་འཛེར། །
en: ‘We are honorable ones.’ “

source: གནས་བརྟན་གང་དག་རྒས་པ་དང་། །རྒས་ཤིང་འཁོགས་པ་གཏུགས་པ་དག །དེ་དག་འཆི་བའི་དུས་བྱེད་ཚེ། །སྲིད་པའི་ཐ་མར་གྱུར་ཅེས་ཟེར། །
en: ‘Elders’ who are merely old, ‘Elders’ who are just aged and decrepit, Will say that when the time for death comes, Their last existence has come to pass.
